tap "buo/cask-upgrade"
tap "tsung-ju/iguanatexmac"
tap "wickenico/wailbrew"
# tap "TheBoredTeam/boring-notch"

# Mac App Store command-line interface
brew "mas"
# Internet file retriever
brew "wget"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Distributed revision control system
brew "git"
# GitHub command-line tool
brew "gh"
# UNIX shell (command interpreter)
brew "zsh"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"

# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2", greedy: true
# Open-source code editor
cask "visual-studio-code", greedy: true
# Desktop client for GitHub repositories
cask "github", greedy: true
# Minimal installer for conda specific to conda-forge
cask "miniforge", greedy: true
# App to build and share containerised applications and microservices
cask "docker-desktop", greedy: true
# Google Chrome Web browser
cask "google-chrome", greedy: true
# Full TeX Live distribution with GUI applications
cask "mactex", greedy: true
# LaTeX typesetting for PowerPoint
cask "iguanatexmac", greedy: true
# Graphical interface for LaTeX
# cask "latexit", greedy: true
# cask "latexit-metadata", greedy: true
# Display management tool
# cask "betterdisplay", greedy: true
# Client for Proton Drive
cask "proton-drive", greedy: true
# Client for Proton Mail and Proton Calendar
cask "proton-mail", greedy: true
# VPN client focusing on security
cask "protonvpn", greedy: true
# Manage Homebrew packages with a UI
# cask "wailbrew", greedy: true
# OpenAI's official ChatGPT desktop app
cask "chatgpt", greedy: true
# Anthropic's official Claude AI desktop app
cask "claude", greedy: true
# Music streaming service
cask "spotify", greedy: true
# Multi-agent programmable modelling environment
cask "netlogo", greedy: true
# Video communication and virtual meeting platform
cask "zoom", greedy: true
# Collect, organise, cite, and share research sources
cask "zotero", greedy: true
# Web browser environment to carry out e-assessments safely
cask "safe-exam-browser", greedy: true
# The boring notch (https://theboring.name)
# cask "boring-notch"

# Fonts (Homebrew casks)
cask "font-fira-code"
cask "font-fira-sans"
# cask "font-inconsolata"
# cask "font-source-code-pro"
# cask "font-source-sans-3"


# vscode "affenwiesel.matlab-formatter"
# vscode "ban.spellright"
# vscode "christian-kohler.path-intellisense"
# vscode "docker.docker"
# vscode "eamodio.gitlens"
# vscode "esbenp.prettier-vscode"
# vscode "george-alisson.html-preview-vscode"
# vscode "github.copilot"
# vscode "github.copilot-chat"
# vscode "james-yu.latex-workshop"
# vscode "mathworks.language-matlab"
# vscode "mechatroner.rainbow-csv"
# vscode "ms-azuretools.vscode-containers"
# vscode "ms-azuretools.vscode-docker"
# vscode "ms-python.black-formatter"
# vscode "ms-python.debugpy"
# vscode "ms-python.isort"
# vscode "ms-python.python"
# vscode "ms-python.vscode-pylance"
# vscode "ms-python.vscode-python-envs"
# vscode "ms-toolsai.datawrangler"
# vscode "ms-toolsai.jupyter"
# vscode "ms-toolsai.jupyter-keymap"
# vscode "ms-toolsai.jupyter-renderers"
# vscode "ms-toolsai.vscode-jupyter-cell-tags"
# vscode "ms-toolsai.vscode-jupyter-slideshow"
# vscode "ms-vscode-remote.remote-containers"
# vscode "ms-vscode-remote.remote-wsl"
# vscode "ms-vscode.makefile-tools"
# vscode "njpwerner.autodocstring"
# vscode "rdebugger.r-debugger"
# vscode "reditorsupport.r"
# vscode "reditorsupport.r-syntax"
# vscode "sleepingsaint.gitignore-generator"
# vscode "visualstudioexptteam.intellicode-api-usage-examples"
# vscode "visualstudioexptteam.vscodeintellicode"
# vscode "xabikos.javascriptsnippets"
# vscode "yzhang.markdown-all-in-one"
# vscode "zainchen.json"
